In [21]:
import pandas as pd

In [22]:
students = {"name":["majid","ali","reza","sara","hasan","mohammad","ahmad","maryam","mina","sahar"],
            "grade":[12,5,18,16.5,7,17,19,13,6,8],
            "Gender":["Male","Male","Male","Female","Male","Male","Male","Female","Female","Female"],
            "Guest":[True,True,False,False,False,False,False,True,True,False],
            "city":["Tehran","Tehran","Mashhad","Yazd","Shiraz","Tehran","Mashhad", "Yazd","Karaj","Tehran"]}

### یک دیکشنری دقیقا با ساختار بالا یعنی نام سرستون ها به عنوان کلید ها و مقادیر به صورت یک لیست را میتوان به نوع دیتافریم تبدیل کرد

In [50]:
df = pd.DataFrame(students)

In [51]:
df

       name  grade  Gender  Guest     city
0     majid   12.0    Male   True   Tehran
1       ali    5.0    Male   True   Tehran
2      reza   18.0    Male  False  Mashhad
3      sara   16.5  Female  False     Yazd
4     hasan    7.0    Male  False   Shiraz
5  mohammad   17.0    Male  False   Tehran
6     ahmad   19.0    Male  False  Mashhad
7    maryam   13.0  Female   True     Yazd
8      mina    6.0  Female   True    Karaj
9     sahar    8.0  Female  False   Tehran

## برای دسترسی به اندازه دیتا یعنی تعداد ستون ها و تعداد سطر ها میتوان به صورت زیر عمل کرد

In [26]:
nrows , ncols = df.shape
print(f"Number of samples: {nrows}\nNumber of features: {ncols}")

Number of samples: 10
Number of features: 5

In [30]:
print(df.columns)
print(df.index)
print(df.values, type(df.values))

Index(['name', 'grade', 'Gender', 'Guest', 'city'], dtype='object')
RangeIndex(start=0, stop=10, step=1)
[['majid' 12.0 'Male' True 'Tehran']
 ['ali' 5.0 'Male' True 'Tehran']
 ['reza' 18.0 'Male' False 'Mashhad']
 ['sara' 16.5 'Female' False 'Yazd']
 ['hasan' 7.0 'Male' False 'Shiraz']
 ['mohammad' 17.0 'Male' False 'Tehran']
 ['ahmad' 19.0 'Male' False 'Mashhad']
 ['maryam' 13.0 'Female' True 'Yazd']
 ['mina' 6.0 'Female' True 'Karaj']
 ['sahar' 8.0 'Female' False 'Tehran']] <class 'numpy.ndarray'>

In [32]:
df.head(n=2)

    name  grade Gender  Guest    city
0  majid   12.0   Male   True  Tehran
1    ali    5.0   Male   True  Tehran

In [33]:
df.tail(2)

    name  grade  Gender  Guest    city
8   mina    6.0  Female   True   Karaj
9  sahar    8.0  Female  False  Tehran

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   grade   10 non-null     float64
 2   Gender  10 non-null     object
 3   Guest   10 non-null     bool
 4   city    10 non-null     object
dtypes: bool(1), float64(1), object(3)
memory usage: 458.0+ bytes

In [38]:
df.describe(include=['object'])

          name Gender    city
count       10     10      10
unique      10      2       5
top     maryam   Male  Tehran
freq         1      6       4

In [42]:
df["name"]

0       majid
1         ali
2        reza
3        sara
4       hasan
5    mohammad
6       ahmad
7      maryam
8        mina
9       sahar
Name: name, dtype: object

In [43]:
type(df["name"])

pandas.core.series.Series

In [45]:
df["grade"]

0    12.0
1     5.0
2    18.0
3    16.5
4     7.0
5    17.0
6    19.0
7    13.0
8     6.0
9     8.0
Name: grade, dtype: float64

In [46]:
df["grade"]>=10

0     True
1    False
2     True
3     True
4    False
5     True
6     True
7     True
8    False
9    False
Name: grade, dtype: bool

In [48]:
df.grade

0    12.0
1     5.0
2    18.0
3    16.5
4     7.0
5    17.0
6    19.0
7    13.0
8     6.0
9     8.0
Name: grade, dtype: float64